# -*- coding: utf-8 -*-
# ----------------------------------
# Project : Tsubasa
# Name    : dccUserMayaSharePythonLib.tsubasa
# Author  : toi
# ----------------------------------
from __future__ import absolute_import
from __future__ import division
from __future__ import print_function
from __future__ import unicode_literals
import re
import os
from collections import OrderedDict

try:
    from pyfbsdk import *
    fbapp = FBApplication()
    fbsys = FBSystem()
    is_motionbuilder = True
except ImportError:
    is_motionbuilder = False

if not is_motionbuilder:
    import maya.cmds as cmds
    # import maya.mel as mm
    # import pymel.core as pm


TSUBASA_CHARA_PATH = 'D:\\cygames\\tsubasa\\work\\chara'
ID = OrderedDict()
ID['pl0000'] = 'グラン（新スキン）'
ID['pl0001'] = 'グラン（ファイター）'
ID['pl0100'] = 'ジータ（新スキン）'
ID['pl0101'] = 'ジータ（ファイター）'
ID['pl0200'] = 'カタリナ'
ID['pl0300'] = 'ラカム'
ID['pl0400'] = 'イオ'
ID['pl0500'] = 'オイゲン'
ID['pl0600'] = 'ロゼッタ'
ID['pl0700'] = 'フェリ'
ID['pl0800'] = 'ランスロット'
ID['pl0900'] = 'ヴェイン'
ID['pl1000'] = 'パーシヴァル'
ID['pl1100'] = 'ジークフリート'
ID['pl1200'] = 'シャルロッテ'
ID['pl1300'] = 'ヨダルラーハ'
ID['pl1400'] = 'ナルメア'
ID['pl1500'] = 'ガンダゴウザ'
ID['pl1600'] = 'ゼタ'
ID['pl1700'] = 'バザラガ'
ID['pl1800'] = 'カリオストロ'
ID['pl1900'] = 'イド'
ID['pl1901'] = 'イド（フード）'
ID['pl2000'] = 'イド（竜人）'
ID['pl2100'] = 'サンダルフォン'
ID['pl2200'] = 'シエテ'
ID['pl2300'] = 'ソーン'

ID['np0000'] = 'ルリア（通常）'
ID['np0001'] = '闇ルリア'
ID['np0100'] = 'ビィ'
ID['np0200'] = 'シェロカルテ'
ID['np0300'] = 'ローラン'
ID['np0400'] = 'イストリアス'
ID['np0500'] = 'リリス（旧名ダリア）'
ID['np0600'] = 'ザスバ'
ID['np0700'] = 'NPC ヒューマン男'
ID['np0701'] = 'NPC ヒューマン男（自動ロール）'
ID['np0702'] = '黄街NPC ヒューマン男'
ID['np0800'] = 'NPC ヒューマン爺'
ID['np0801'] = 'NPC ヒューマン爺（自動ロール）'
ID['np1000'] = 'NPC ヒューマン女'
ID['np1001'] = 'NPC ヒューマン女（自動ロール）'
ID['np1010'] = 'NPC ヒューマン女（追加髪型）'
ID['np1002'] = '黄街NPC ヒューマン女'
ID['np1200'] = 'NPC エルーン男'
ID['np1201'] = 'NPC エルーン男（自動ロール）'
ID['np1202'] = '黄街NPC エルーン男'
ID['np1300'] = 'NPC エルーン女'
ID['np1301'] = 'NPC エルーン女（自動ロール）'
ID['np1302'] = '黄街NPC エルーン女'
ID['np1310'] = 'NPC エルーン女（追加髪型）'
ID['np1400'] = 'NPC ハーヴィン男'
ID['np1401'] = 'NPC ハーヴィン男（自動ロール）'
ID['np1402'] = '黄街NPC ハーヴィン男'
ID['np1500'] = 'NPC ハーヴィン女'
ID['np1501'] = 'NPC ハーヴィン女（自動ロール）'
ID['np1502'] = '黄街NPC ハーヴィン女'
ID['np1510'] = 'NPC ハーヴィン女（追加髪型）'
ID['np1600'] = 'NPC ドラフ男'
ID['np1601'] = 'NPC ドラフ男（自動ロール）'
ID['np1602'] = '黄街NPC ドラフ男'
ID['np1700'] = 'NPC ドラフ女'
ID['np1701'] = 'NPC ドラフ女（自動ロール）'
ID['np1702'] = '黄街NPC ドラフ女'
ID['np1710'] = 'NPC ドラフ女（追加髪型）'
ID['np1800'] = 'マロース僧兵'
ID['np1900'] = '黄島兵士'
ID['np2000'] = 'ヒューマン男(子供)'
ID['np2100'] = 'ヒューマン女(子供)'
ID['np2110'] = 'ヒューマン女(子供)（追加髪型）'
ID['np2200'] = 'クエスト受付嬢（赤街）'
ID['np2201'] = 'クエスト受付嬢（黄街）'

ID['em0000'] = 'ゴブリン突撃兵'
ID['em0001'] = 'ゴブリン呪術兵'
ID['em0002'] = 'ゴブリン重装兵'
ID['em0003'] = 'ゴブリン弓兵'
ID['em0004'] = 'ゴブリンソルジャー'
ID['em0005'] = 'ゴブリンナイト'
ID['em0006'] = 'ゴブリン共通データ'
ID['em0100'] = 'スケルトン'
ID['em0101'] = 'ボーンフロスティ'
ID['em0102'] = 'ゲラシーン'
ID['em0103'] = 'スカルミリオーネ'
ID['em0200'] = 'ラウンドウルフ'
ID['em0201'] = 'ゴブリンライダー'
ID['em0300'] = 'ホーンバード'
ID['em0400'] = 'ワイバーン'
ID['em0500'] = 'ストンダイル'
ID['em0501'] = 'ブリズダイル'
ID['em0502'] = 'フレイダイル'
ID['em0600'] = 'スライム'
ID['em0601'] = 'シルバースライム'
ID['em0602'] = 'ゴールドスライム'
ID['em0603'] = 'キングシルバースライム'
ID['em0604'] = 'キングゴールドスライム'
ID['em0700'] = 'アーフラー（アーリマン火）'
ID['em0701'] = 'シアエガ（アーリマン水）'
ID['em0702'] = 'ディモルフォドン（アーリマン土）'
ID['em0703'] = 'ゲイザー（アーリマン風）'
ID['em0704'] = 'ヨグ＝ソトース（アーリマン光）'
ID['em0705'] = 'アーリマン'
ID['em0706'] = 'ナザルボンジュ'
ID['em0800'] = 'フレイムシード'
ID['em0801'] = 'アクアシード'
ID['em0802'] = 'アースシード'
ID['em0803'] = 'ウインドシード'
ID['em0804'] = 'ホーリーシード'
ID['em0805'] = 'ダークシード'
ID['em0900'] = 'フレイムスタチュー'
ID['em0901'] = 'ウインドスタチュー'
ID['em0902'] = 'アクアスタチュー'
ID['em0903'] = 'アーススタチュー'
ID['em1000'] = 'アヴィアス・セイバー'
ID['em1001'] = 'アヴィアス・ランサー'
ID['em1002'] = 'アヴィアス・アーチャー'
ID['em1003'] = 'アヴィアス・フラッグビーラー'
ID['em1004'] = '教団騎士（赤）（教団兵士長 A）'
ID['em1005'] = '教団騎士（青）（教団兵士長 B）'
ID['em1100'] = '幻兵'
ID['em1200'] = 'ヴァザーラプトル'
ID['em1201'] = 'ヴァザーラプトル low'
ID['em1300'] = 'ドロイタ・センチネル'
ID['em1301'] = 'ドロイタ・マザー'
ID['em1302'] = 'ドロイタ・ビット 大傘'
ID['em1303'] = 'ドロイタ・バルサム'
ID['em1400'] = '木人（≠トッくん）'
ID['em1500'] = 'ロックゴーレム'
ID['em1501'] = 'ロックゴーレム（起動前）'
ID['em1502'] = 'ラーヴァゴーレム'
ID['em1600'] = 'グリフォン'
ID['em1700'] = 'ベヒーモス'
ID['em1800'] = 'エンシェントドラゴン'
ID['em1801'] = '火竜ヴレッザレク'
ID['em1802'] = '氷竜ウィリヌス'
ID['em1803'] = '地竜ドルベイル'
ID['em1804'] = '風竜イールシアス'
ID['em1805'] = '白竜ラディス'
ID['em1806'] = '黒竜イーヴィル'
ID['em1900'] = 'タイユタール'
ID['em2000'] = 'ガランツァ将軍'
ID['em2001'] = 'ガランツァ将軍（フード）'
ID['em2100'] = 'マギラフリラ将軍'
ID['em2101'] = 'マギラフリラ将軍（フード）'
ID['em2200'] = 'イド敵用ID'
ID['em2300'] = '竜人イド'
ID['em2400'] = 'リリス（旧名ダリア）'
ID['em2500'] = 'スニッパー'
ID['em2600'] = 'コブラ'
ID['em2700'] = 'トッくん'
ID['em2800'] = '禍つ影'
ID['em3100'] = 'セスラカ'
ID['em3400'] = 'ウィンドラビット'
ID['em7000'] = 'プロトバハムート'
ID['em7100'] = 'ヴォルカンボーラ'
ID['em7101'] = 'ヴォルカンボーラ 胴'
ID['em7102'] = 'ヴォルカンボーラ 尻尾'
ID['em7103'] = 'ヴォルカンボーラ 子供'
ID['em7200'] = 'フラカーン（人馬）'
ID['em7201'] = 'フラカーン（女神）'
ID['em7300'] = 'マナガルム（全タイプ）'
ID['em7400'] = 'エクスカリオン'
ID['em7401'] = 'エクスカリオンのコア'
ID['em7402'] = 'エクスカリオンの足元装甲'
ID['em7403'] = 'エクスカリオンの足元装甲大'
ID['em7404'] = 'エクスカリオンのうなじコア'
ID['em7405'] = 'エクスカリオンのうなじ装甲01'
ID['em7406'] = 'エクスカリオンメインコアのファンネル'
ID['em7407'] = 'エクスカリオン胴部コア'
ID['em7460'] = '検証用エクスカリオン比較用本体'
ID['em7470'] = '検証用エクスカリオン本体'
ID['em7471'] = '検証用エクスカリオンの足元コア'
ID['em7472'] = '検証用エクスカリオンの足元装甲'
ID['em7473'] = '検証用エクスカリオンの足元装甲大'
ID['em7474'] = '検証用エクスカリオンの足元装甲内'
ID['em7480'] = 'エクスカリオンのダウンモデル用コリジョン'
ID['em7481'] = 'エクスカリオンのバスターモデル用コリジョン'
ID['em7500'] = 'アンラ・マンユ 第一形態'
ID['em7501'] = 'アンラ・マンユ 翼手 第一形態'
ID['em7502'] = 'アンラ・マンユ 第二形態'
ID['em7503'] = 'アンラ・マンユ 翼手 第二形態'
ID['em7504'] = 'アンラ・マンユ スカート'
ID['em7505'] = 'アンラ・マンユ 第三形態'
ID['em7520'] = 'アンラ・マンユ 翼手1（検証）'
ID['em7521'] = 'アンラ・マンユ 翼手2（検証）'
ID['em7522'] = 'アンラ・マンユ 翼手3（検証）'
ID['em7523'] = 'アンラ・マンユ 翼手4（検証）'
ID['em7524'] = 'アンラ・マンユ 翼手5（検証）'
ID['em7525'] = 'アンラ・マンユ 翼手6（検証）'
ID['em7526'] = 'アンラ・マンユ 翼手7（検証）'
ID['em7527'] = 'アンラ・マンユ 翼手8（検証）'
ID['em7528'] = 'アンラ・マンユ 翼手9（検証）'
ID['em7529'] = 'アンラ・マンユ 翼手10（検証）'
ID['em7530'] = 'メガ翼手 右手'
ID['em7531'] = 'メガ翼手 左手'
ID['em7600'] = 'バハムート・オルタ'
ID['em7601'] = 'バハムートオルタの結晶羽'
ID['emffff'] = '敵共通データ用ダミー'

ID['wp0000'] = 'グラン 旅立ちの剣'
ID['wp0001'] = 'グラン デュランダル'
ID['wp0002'] = 'グラン リリンク武器'
ID['wp0003'] = 'グラン アルバコアブレード'
ID['wp0004'] = 'グラン オメガスウォード'
ID['wp0005'] = 'グラン 七星剣'
ID['wp0100'] = 'ジータ パルテンツァ'
ID['wp0101'] = 'ジータ リリンク武器 (ID確保用)'
ID['wp0200'] = 'カタリナ ルカ・ルサ'
ID['wp0201'] = 'グラン デュランダル'
ID['wp0202'] = 'カタリナ ミュルグレス'
ID['wp0203'] = 'カタリナ シュヴァリエソード・マグナ'
ID['wp0204'] = 'カタリナ エフェメロン'
ID['wp0205'] = 'カタリナ ブルトガンク'
ID['wp0290'] = 'カタリナ アレス'
ID['wp0291'] = 'カタリナ アレス剣'
ID['wp0292'] = 'カタリナ アレス盾'
ID['wp0300'] = 'ラカム 初期武器'
ID['wp0301'] = 'ラカム ホイルロックアックス'
ID['wp0302'] = 'ラカム ベネディーア'
ID['wp0303'] = 'ラカム ティアマトボルト・マグナ'
ID['wp0304'] = 'ラカム ブラッククラウド'
ID['wp0305'] = 'ラカム フライクーゲル'
ID['wp0370'] = 'ラカム 短銃'
ID['wp0400'] = 'イオ リトルウィッチセプター'
ID['wp0401'] = 'イオ ジェズル'
ID['wp0402'] = 'イオ ガンバンテイン'
ID['wp0403'] = 'イオ コロッサスケーン・マグナ'
ID['wp0404'] = 'イオ トゥプシマティ'
ID['wp0405'] = 'イオ カドゥケウス'
ID['wp0500'] = 'オイゲン ドライゼン'
ID['wp0501'] = 'オイゲン マッチロック'
ID['wp0502'] = 'オイゲン エーケイ・フォーエイ'
ID['wp0503'] = 'オイゲン レヴィアンマズル'
ID['wp0504'] = 'オイゲン クラリオン'
ID['wp0505'] = 'オイゲン ドラゴニックファイア'
ID['wp0600'] = 'ロゼッタ エゴイズム'
ID['wp0601'] = 'ロゼッタ ソードブレイカー'
ID['wp0602'] = 'ロゼッタ エターナル・ラヴ'
ID['wp0603'] = 'ロゼッタ ローズクリスタルナイフ'
ID['wp0604'] = 'ロゼッタ コルタナ'
ID['wp0605'] = 'ロゼッタ バハムートダガー・フツルス'
ID['wp0690'] = 'ロゼッタ バラ結界'
ID['wp0691'] = 'ロゼッタ 蔦2'
ID['wp0700'] = 'フェリ ガイストパイチェ'
ID['wp0701'] = 'フェリ レザーベルト'
ID['wp0702'] = 'フェリ オーラフラジェルム'
ID['wp0703'] = 'フェリ ファイアウィップ'
ID['wp0704'] = 'フェリ ボルティッシュワイヤ'
ID['wp0705'] = 'フェリ リミテッド進化後デザイン武器'
ID['wp0790'] = 'フェリ 幽霊A モモ'
ID['wp0791'] = 'フェリ 幽霊B フージー'
ID['wp0792'] = 'フェリ 幽霊C 二コラ'
ID['wp0793'] = 'フェリ 幽霊D ジジ'
ID['wp0794'] = 'フェリ 幽霊E ベッポ'
ID['wp0800'] = 'ランスロット アルタキエラ'
ID['wp0801'] = 'ランスロット 霧氷剣ペルソス'
ID['wp0802'] = 'ランスロット 風属性デザイン武器'
ID['wp0803'] = 'ランスロット ベガルタ'
ID['wp0804'] = 'ランスロット ナイト・オブ・アイス'
ID['wp0805'] = 'ランスロット ダマスカスナイフ'
ID['wp0900'] = 'ヴェイン SRデザイン武器'
ID['wp0901'] = 'ヴェイン オリジナル武器'
ID['wp0902'] = 'ヴェイン SSRデザイン武器'
ID['wp0903'] = 'ヴェイン ウコンバサラ'
ID['wp0904'] = 'ヴェイン ブロッサムアクス'
ID['wp0905'] = 'ヴェイン ミョルニル'
ID['wp1000'] = 'パーシヴァル フランベルジュ'
ID['wp1001'] = 'パーシヴァル ローエングリン'
ID['wp1002'] = 'パーシヴァル アントウェルペン'
ID['wp1003'] = 'パーシヴァル ジュワユース'
ID['wp1004'] = 'パーシヴァル オリジナル'
ID['wp1005'] = 'パーシヴァル ゴットフリート'
ID['wp1100'] = 'ジークフリート 初期武器'
ID['wp1101'] = 'ジークフリート 大地の剣'
ID['wp1102'] = 'ジークフリート アスカロン'
ID['wp1103'] = 'ジークフリート フルンティング'
ID['wp1104'] = 'ジークフリート ヴィントホーゼ'
ID['wp1105'] = 'ジークフリート バルムンク'
ID['wp1200'] = 'シャルロッテ クラウ・ソラス'
ID['wp1201'] = 'シャルロッテ アロンダイト'
ID['wp1202'] = 'シャルロッテ クレイヴソリッシュ'
ID['wp1203'] = 'シャルロッテ ウシュムガル'
ID['wp1204'] = 'シャルロッテ シャフレワル'
ID['wp1205'] = 'シャルロッテ ガラティーン'
ID['wp1300'] = 'ヨダルラーハ 水SSRデザイン武器'
ID['wp1301'] = 'ヨダルラーハ 阿修羅'
ID['wp1302'] = 'ヨダルラーハ 不動国行'
ID['wp1303'] = 'ヨダルラーハ オリジナル'
ID['wp1304'] = 'ヨダルラーハ 六道・普天幻魔'
ID['wp1305'] = 'ヨダルラーハ 太刀魚'
ID['wp1400'] = 'ナルメア 中巻野太刀'
ID['wp1401'] = 'ナルメア 虎徹'
ID['wp1402'] = 'ナルメア 丙子椒林剣'
ID['wp1403'] = 'ナルメア 蛍丸'
ID['wp1404'] = 'ナルメア 清めと祓いの刃'
ID['wp1405'] = 'ナルメア 天羽々斬'
ID['wp1470'] = 'ナルメア 変形武器'
ID['wp1500'] = 'ガンダゴウザ 梵天添甲'
ID['wp1501'] = 'ガンダゴウザ 綱巻甲'
ID['wp1502'] = 'ガンダゴウザ クリムゾンフィンガー'
ID['wp1503'] = 'ガンダゴウザ オリジナル武器'
ID['wp1504'] = 'ガンダゴウザ アルカブ'
ID['wp1505'] = 'ガンダゴウザ 方天画戟'
ID['wp1600'] = 'ゼタ アルベスの槍'
ID['wp1601'] = 'ゼタ サンスポットスピア'
ID['wp1602'] = 'ゼタ ブリューナク'
ID['wp1603'] = 'ゼタ グラーシーザー'
ID['wp1604'] = 'ゼタ 黄龍槍'
ID['wp1605'] = 'ゼタ ゲイボルグ'
ID['wp1700'] = 'バザラガ 大鎌グロウノス'
ID['wp1701'] = 'バザラガ アルサラブ'
ID['wp1702'] = 'バザラガ ウルツァイトサイズ'
ID['wp1703'] = 'バザラガ ソウルイーター'
ID['wp1704'] = 'バザラガ サイス・オブ・コスモス'
ID['wp1705'] = 'バザラガ オリジナル武器(hayao先行)'
ID['wp1800'] = 'カリオストロ マグヌム・オプス'
ID['wp1801'] = 'カリオストロ 夢見の書'
ID['wp1802'] = 'カリオストロ オリジナル武器'
ID['wp1803'] = 'カリオストロ ホーリーインデックス'
ID['wp1804'] = 'カリオストロ アーシヴェル'
ID['wp1805'] = 'カリオストロ オリジナル武器(hayao先行)'
ID['wp1890'] = 'カリオストロ ウロボロス'
ID['wp1891'] = 'カリオストロの錬金武器'
ID['wp1892'] = 'カリオストロの銅像'
ID['wp1900'] = 'イド 初期武器'
ID['wp1901'] = 'イド オリジナル武器(アヴィアモチーフ)'
ID['wp1902'] = 'イド オリジナル武器(イドモチーフ)'
ID['wp1903'] = 'イド プレミアムソード'
ID['wp1904'] = 'イド エッケザックス'
ID['wp1905'] = 'イド バハムートソード'
ID['wp2100'] = 'サンダルフォン 初期武器'
ID['wp2200'] = 'シエテ 初期武器'
ID['wp2300'] = 'ソーン 初期武器'

ID['wpbase0000'] = 'グラン 基準武器'
ID['wpbase0100'] = 'ジータ 基準武器'
ID['wpbase0200'] = 'カタリナ 基準武器'
ID['wpbase0300'] = 'ラカム 基準武器'
ID['wpbase0400'] = 'イオ 基準武器'
ID['wpbase0500'] = 'オイゲン 基準武器'
ID['wpbase0600'] = 'ロゼッタ 基準武器'
ID['wpbase0700'] = 'フェリ 基準武器'
ID['wpbase0800'] = 'ランスロット 基準武器'
ID['wpbase0900'] = 'ヴェイン 基準武器'
ID['wpbase1000'] = 'パーシヴァル 基準武器'
ID['wpbase1100'] = 'ジークフリート 初期武器'
ID['wpbase1200'] = 'シャルロッテ 基準武器'
ID['wpbase1300'] = 'ヨダルラーハ 基準武器'
ID['wpbase1400'] = 'ナルメア 基準武器'
ID['wpbase1500'] = 'ガンダゴウザ 基準武器'
ID['wpbase1600'] = 'ゼタ 基準武器'
ID['wpbase1700'] = 'バザラガ 基準武器'
ID['wpbase1800'] = 'カリオストロ 基準武器'
ID['wpbase1900'] = 'イド 基準武器'
ID['wpbase2100'] = 'サンダルフォン 基準武器'
ID['wpbase2200'] = 'シエテ 基準武器'
ID['wpbase2300'] = 'ソーン 基準武器'

ID['wn0200'] = 'シェロカルテのオウム'
ID['wn0300'] = 'ローラン剣'
ID['wn0301'] = 'ローランの魔力ムチ'
ID['wn0400'] = 'イストリアスのランタン'
ID['wn0500'] = 'ダリアの杖'
ID['wn0580'] = '検証用ダリアの杖'
ID['wn0600'] = 'ザスバ　斧'
ID['wn0601'] = 'ザスバ　短剣'
ID['wn0800'] = 'ヒューマン爺の杖'
ID['wn1800'] = 'エルーン修道僧の杖'
ID['wn1900'] = '黄島兵士 武器'

ID['we0000'] = 'ゴブリン剣'
ID['we0001'] = 'ゴブリン盾'
ID['we0002'] = 'ゴブリン杖'
ID['we0003'] = 'ゴブリン重装兵の剣'
ID['we0004'] = 'ゴブリン重装兵の盾'
ID['we0005'] = 'ゴブリンライダー用ハルバード'
ID['we0006'] = 'ゴブリンの弓'
ID['we0007'] = 'ゴブリンの矢'
ID['we0008'] = 'ゴブリンの矢筒'
ID['we0009'] = 'ゴブリンソルジャーの剣'
ID['we0010'] = 'ゴブリンソルジャーの盾'
ID['we0011'] = 'ゴブリンナイトの剣'
ID['we0012'] = 'ゴブリンナイトの盾'
ID['we0100'] = 'スケルトン剣'
ID['we0101'] = 'スケルトン盾'
ID['we0102'] = '辺獄ソード'
ID['we0103'] = '辺獄シールド'
ID['we0104'] = 'スケルトン大　武器'
ID['we0105'] = 'スカルミリオーネの氷斧'
ID['we1000'] = '教団兵(剣）の剣'
ID['we1001'] = '教団兵(剣）の盾'
ID['we1002'] = '教団兵（リーダー）の剣'
ID['we1003'] = '教団兵（リーダー）の盾'
ID['we1004'] = '教団兵(槍）の槍'
ID['we1005'] = '教団兵（槍）の盾'
ID['we1006'] = '教団兵(弓）の弓'
ID['we1007'] = '教団兵（弓）の矢'
ID['we1008'] = '教団兵(弓）ダガー'
ID['we1009'] = '教団弓兵の矢筒'
ID['we1010'] = '教団エリート兵の槍（旗つき）'
ID['we1100'] = '幻兵　鞘'
ID['we1101'] = 'マギラフリラ兵の剣'
ID['we1200'] = 'ヴァザーラプトルのミサイル'
ID['we1201'] = 'ヴァザーラプトルのグレネード弾'
ID['we1202'] = '汎用グレネード弾'
ID['we1900'] = 'タイユタールの武装１　腕　チェーンソーブレード'
ID['we1901'] = 'タイユタールの武装2　腕　ハンマーアーム'
ID['we1902'] = 'タイユタールの武装3　腕　ガトリグガン'
ID['we1903'] = 'タイユタールの武装4　腕　火炎放射機'
ID['we1904'] = 'タイユタールの武装5　肩　エナジーミサイル'
ID['we1905'] = 'タイユタールの武装5　肩外側　エナジーミサイル右'
ID['we1906'] = 'タイユタールの武装5　肩外側　エナジーミサイル左'
ID['we2000'] = 'ガランツァ将軍武器'
ID['we2001'] = 'ガランツァ将軍武器（デモ用）'
ID['we2100'] = 'マギラフリラ将軍の剣'
ID['we2110'] = 'マギラフリラ　銃'
ID['we2111'] = 'マギラフリラ　斧'
ID['we2112'] = 'マギラフリラ　杖'
ID['we2113'] = 'マギラフリラ　槍'
ID['we2200'] = 'イド敵用の武器ID'
ID['we2400'] = 'リリス敵用の武器ID'
ID['we2700'] = 'とっくん剣'
ID['we2701'] = 'とっくん盾'
ID['we3100'] = 'セスラカファンネル'
ID['we7200'] = '風の星晶獣ランス'
ID['we7201'] = 'ケンタウロス左手武器'
ID['we7202'] = '風の星晶獣 女神形態 剣'
ID['we7300'] = 'マナガルム　ファング'
ID['we7500'] = 'アンラマンユ　闇結晶（小）'
ID['we7501'] = 'アンラマンユ　闇結晶（大）'
ID['we7502'] = 'アンラマンユ　ダークメテオ'

ID['fp0000'] = 'グラン（フェイス）'
ID['fp0100'] = 'ジータ（フェイス）'
ID['fp0200'] = 'カタリナ（フェイス）'
ID['fp0300'] = 'ラカム（フェイス）'
ID['fp0400'] = 'イオ（フェイス）'
ID['fp0500'] = 'オイゲン（フェイス）'
ID['fp0600'] = 'ロゼッタ（フェイス）'
ID['fp0700'] = 'フェリ（フェイス）'
ID['fp0800'] = 'ランスロット（フェイス）'
ID['fp0900'] = 'ヴェイン（フェイス）'
ID['fp1000'] = 'パーシヴァル（フェイス）'
ID['fp1100'] = 'ジークフリート（フェイス）'
ID['fp1200'] = 'シャルロッテ（フェイス）'
ID['fp1300'] = 'ヨダルラーハ（フェイス）'
ID['fp1400'] = 'ナルメア（フェイス）'
ID['fp1500'] = 'ガンダゴウザ（フェイス）'
ID['fp1600'] = 'ゼタ（フェイス）'
ID['fp1700'] = 'バザラガ（フェイス）'
ID['fp1800'] = 'カリオストロ（フェイス）'
ID['fp1900'] = 'イド（フェイス）'
ID['fp2000'] = 'イド（竜人）（フェイス）'
ID['fp2100'] = 'サンダルフォン（フェイス）'
ID['fp2200'] = 'シエテ（フェイス）'
ID['fp2300'] = 'ソーン（フェイス）'

ID['fn0000'] = 'ルリア（フェイス）'
ID['fn0001'] = '闇ルリア（low）'
ID['fn0100'] = 'ビィ（フェイス）'
ID['fn0101'] = 'ビィ（low）（フェイス）'
ID['fn0200'] = 'シェロカルテ（フェイス）'
ID['fn0300'] = 'ローラン（フェイス）'
ID['fn0400'] = 'イストリアス（フェイス）'
ID['fn0500'] = 'リリス（フェイス）'
ID['fn0600'] = 'ザスバ（フェイス）'
ID['fn0700'] = 'NPC ヒューマン男（フェイス）'
ID['fn0800'] = 'NPC ヒューマン爺（フェイス）'
ID['fn1000'] = 'NPC ヒューマン女（フェイス）'
ID['fn1200'] = 'NPC エルーン男（フェイス）'
ID['fn1300'] = 'NPC エルーン女（フェイス）'
ID['fn1400'] = 'NPC ハーヴィン男（フェイス）'
ID['fn1500'] = 'NPC ハーヴィン女（フェイス）'
ID['fn1600'] = 'NPC ドラフ男（フェイス）'
ID['fn1700'] = 'NPC ドラフ女（フェイス）'
ID['fn1800'] = 'マロース僧兵（フェイス）'
ID['fn1900'] = '黄島兵士（フェイス）'
ID['fn2000'] = 'ヒューマン男(子供)（フェイス）'
ID['fn2100'] = 'ヒューマン女(子供)（フェイス）'
ID['fn2200'] = 'クエスト受付嬢（フェイス）'


# プライマリジョイント（HumanIKに登録する骨：人型）
PRIMARY_JOINTS = (
    '_000', '_001', '_002', '_003', '_004', '_005',
    '_006', '_007', '_008', '_009',
    '_100', '_101', '_102', '_103',
    '_110', '_111', '_112', '_113',
    '_120', '_121', '_122', '_123',
    '_130', '_131', '_132', '_133',
    '_140', '_141', '_142', '_143',
    '_00a', '_00b', '_00c', '_00d',
    '_200', '_201', '_202', '_203',
    '_210', '_211', '_212', '_213',
    '_220', '_221', '_222', '_223',
    '_230', '_231', '_232', '_233',
    '_240', '_241', '_242', '_243',
    '_012', '_013', '_014', '_015',
    '_00e', '_00f', '_010', '_011',
)


def getId(scene_path):
    """シーン名からid取得"""    
    scene_name = os.path.basename(scene_path)
    if 'wpbase' in scene_name:
         result = re.match('\w\w\w\w\w\w[0-9A-Fa-f]{4}', scene_name)
    else:
         result = re.match('\w\w[0-9A-Fa-f]{4}', scene_name)
        
    if result is None:
        return None
    else:
        return result.group()


def _getIdFromRoot():
    """シーン内のノードからid取得（mayaのみ）"""

    id_ = None
    top_nodes = cmds.ls(assemblies=True)
    for node in top_nodes:
        if re.match('\w\w[0-9A-Fa-f]{4}', node):
            id_ = node
            break
    return id_


def getCate(scene_path):
    """カテゴリー"""
    return getId(scene_path)[:2]


def getCharaWorkPathFromId(id_):
    _cate = id_[:2]
    return os.path.join('D:/cygames/tsubasa/work/chara/{0}/{1}/'.format(_cate, id_))


def getCharaProjectPathFromId(id_):
    _cate = id_[:2]
    return os.path.join('D:/project/PRJ_034/p1/assets/work/{0}/{1}/'.format(_cate, id_))


def getIDNum(scene_path):
    """シーン名からidの番号部分のみ取得"""
    return getId(scene_path)[2:]


def getIdDir(scene_path):
    return os.path.join(TSUBASA_CHARA_PATH, getCate(scene_path), getId(scene_path))


def openCurrentIdDir():
    os.startfile(getIdDir(cmds.file(q=True, sn=True)))


def assistDriveMoveRangeCalculation(move_length, min_angle, max_angle, specified_current_angle=0):
    ratio = move_length / 180
    move_range_st = max_angle * ratio
    move_range_end = min_angle * ratio
    if specified_current_angle:
        move_range_st = ratio * specified_current_angle


def selPrimaryJoints():
    """ プライマリージョイント（人型）の選択 """

    cmds.select(cl=True)
    for pj in PRIMARY_JOINTS:
        try:
            cmds.select(pj, add=True)
        except:
            pass


def getJointsExceptADN():
    null = cmds.ls('null')
    if not null:
        return

    joints = cmds.ls(null, dag=True, type='joint')
    result_list = []
    for joint in joints:
        if not joint.startswith('_a'):
            result_list.append(joint)
    return result_list


def selJointsExceptADN():
    joints = getJointsExceptADN()
    cmds.select(joints)










